---
kind: method
id: M:Autodesk.Revit.DB.FilteredWorksetIterator.Dispose
source: html/e59a2f88-75b0-8633-ecac-ca79cadd2bfc.htm
---
# Autodesk.Revit.DB.FilteredWorksetIterator.Dispose Method

Releases all resources used by the FilteredWorksetIterator

## Syntax (C#)
```csharp
public void Dispose()
```